# Yu-Gi-Oh! Trading Cards Dataset

## Import Pandas Package
Import pandas sebagai pd
dan df membaca dataset

In [37]:
import pandas as pd

In [38]:
df = pd.read_csv("card_data.csv")

# Membaca Dataset

In [39]:
df

,Name,Type,Level,Race,Attribute,ATK,DEF
0,Limit Reverse,Trap Card,NaN,Continuous,NaN,NaN,NaN
1,The 13th Grave,Normal Monster,3.0,Zombie,DARK,1200.0,900.0
2,Gem-Enhancement,Trap Card,NaN,Normal,NaN,NaN,NaN
3,Magician's Circle,Trap Card,NaN,Normal,NaN,NaN,NaN
4,Castle of Dark Illusions,Flip Effect Monster,4.0,Fiend,DARK,920.0,1930.0
...,...,...,...,...,...,...,...
6529,Wattcancel,Trap Card,NaN,Counter,NaN,NaN,NaN
6530,Paleozoic Anomalocaris,XYZ Monster,2.0,Aqua,WATER,2400.0,0.0
6531,Dark Magician,Normal Monster,7.0,Spellcaster,DARK,2500.0,2100.0
6532,Odd-Eyes Pendulum Dragon,Pendulum Effect Monster,7.0,Dragon,DARK,2500.0,2000.0
6533,Stardust Dragon,Synchro Monster,8.0,Dragon,WIND,2500.0,2000.0

In [40]:
df.dtypes

Name          object
Type          object
Level        float64
Race          object
Attribute     object
ATK          float64
DEF          float64
dtype: object

### Informasi yang didapatkan adalah 
jumlah record, 

nama attribute, 

jumlah attribute dengan tipe objek,

jumlah attribute dengan tipe angka, 

jumlah attribute yang memiliki nilai null.

## Masukkan informasi di atas dalam dictionary dengan key sesuai nama informasinya. Tampilkan isi dari dictionary tersebut sebagus mungkin.

In [41]:
totalRecord = len(df)
namaAttribute = df.columns
jumlahObjek = len(df.select_dtypes(include=['object']).columns)
jumlahAngka = len(df.select_dtypes(include=['int64', 'float64']).columns)
jumlahNULL = len(df.columns[df.isna().sum() > 0])

dictionary_no1 = {
    "total record": totalRecord,
    "Nama Attribute yang ada": namaAttribute,
    "Jumlah Objek": jumlahObjek,
    "Jumlah Angka": jumlahAngka,
    "Jumlah NULL": jumlahNULL,
}

pd.Series(dictionary_no1)

total record                                                            6534
Nama Attribute yang ada    Index(['Name', 'Type', 'Level', 'Race', 'Attri...
Jumlah Objek                                                               4
Jumlah Angka                                                               3
Jumlah NULL                                                                4
dtype: object

### Tampilkan rata-rata, standar deviasi, nilai minimum, nilai maksimum, Q1, Q2, dan Q3 dari attribute bertipe angka.

#### Tampilkan Nilai rata-rata dengan fungsi mean()

In [42]:
df.select_dtypes(include=['int64', 'float64']).mean()

Level       4.449591
ATK      1455.553216
DEF      1212.318129
dtype: float64

#### Tampilkan Nilai Standar deviasi dengan fungsi std()

In [43]:
df.select_dtypes(include=['int64', 'float64']).std()

Level      2.185045
ATK      899.165365
DEF      802.966529
dtype: float64

#### Tampilkan Nilai Minimum dengan fungsi min()

In [44]:
df.select_dtypes(include=['int64', 'float64']).min()

Level    1.0
ATK      0.0
DEF      0.0
dtype: float64

#### Tampilkan Nilai Maksimum dengan fungsi max()

In [45]:
df.select_dtypes(include=['int64', 'float64']).max()

Level      12.0
ATK      5000.0
DEF      5000.0
dtype: float64

 #### Tampilkan Nilai Q1, Q2, dan Q3 dengan fungsi quantile()

In [46]:
df.select_dtypes(include=['int64', 'float64']).quantile([0.25,0.5,0.75])

      Level     ATK     DEF
0.25    3.0   800.0   600.0
0.50    4.0  1500.0  1200.0
0.75    6.0  2100.0  1800.0

### Menampilakn semua sekaligus diatas dengan fungsi .describe()

In [47]:
df.describe()

             Level          ATK          DEF
count  4275.000000  4275.000000  4275.000000
mean      4.449591  1455.553216  1212.318129
std       2.185045   899.165365   802.966529
min       1.000000     0.000000     0.000000
25%       3.000000   800.000000   600.000000
50%       4.000000  1500.000000  1200.000000
75%       6.000000  2100.000000  1800.000000
max      12.000000  5000.000000  5000.000000

### Tampilkan nilai korelasi attribute bertipe angka.

In [48]:
df.select_dtypes(include=['int64', 'float64']).corr()

          Level       ATK       DEF
Level  1.000000  0.725354  0.592225
ATK    0.725354  1.000000  0.508246
DEF    0.592225  0.508246  1.000000

### Rubah nilai salah satu attribute bertipe angka menjadi dari desimal menjadi bilangan bulat).
Dikarnekan ada error [cannot convert non-finite values (na or inf) to integer] Yang mungkin disebab kan adanya nilai Null pada atribute, maka saya buat dua cara

1. [errors='ignore'] yang dimana error akan di abaikan dan akan mejalan kan perintah tampa menegeluarkan peringatan error

2. Metode yang saya temukan di Stack Overflow
yang mengguankan 'fillna function' yang dimana akan mengubah value Null dengan value yang sudah ditentukan

#### Metode [errors='ignore']

In [49]:
df["Level"] = df["Level"].astype('int64', errors='ignore')
df["Level"].dtypes

dtype('float64')

In [50]:
df["Level"] = df["Level"].astype('float64', errors='ignore')

#### Metode [fillna function]

In [51]:
df = df.fillna(0)
df.Level.astype('int64')

0       0
1       3
2       0
3       0
4       4
       ..
6529    0
6530    2
6531    7
6532    7
6533    8
Name: Level, Length: 6534, dtype: int64

### Tampilkan 10 record pertama dari attribute bertipe angka.

In [52]:
df.select_dtypes(include=['int64', 'float64']).head(10)

   Level     ATK     DEF
0    0.0     0.0     0.0
1    3.0  1200.0   900.0
2    0.0     0.0     0.0
3    0.0     0.0     0.0
4    4.0   920.0  1930.0
5    0.0     0.0     0.0
6    8.0  3000.0  2500.0
7    0.0     0.0     0.0
8    3.0  1400.0   300.0
9    6.0  2100.0   200.0

### Simpan dataset dengan attribute bertipe angka ke dalam file CSV.

In [53]:
df.select_dtypes(include=['int64', 'float64']).to_csv("Atribut_Bertipe Angka_Yu-Gi-Oh!.csv", index=False)